Autodesk.Revit.DB.BoxPlacement
An enumerated type listing possible placement of a box (an object of rectangular shape).

Autodesk.Revit.DB.BoxPlacement.BottomLeft
Placement of a box by its bottom left corner.

Autodesk.Revit.DB.BoxPlacement.BottomRight
Placement of a box by its bottom right corner.

Autodesk.Revit.DB.BoxPlacement.TopRight
Placement of a box by its top right corner.

Autodesk.Revit.DB.BoxPlacement.TopLeft
Placement of a box by its top left corner.

Autodesk.Revit.DB.BoxPlacement.Center
Placement of a box by its center point.